# slovar = {"key1": "value1",
#           "key2": "value2",
#           "key3": "value3",
#           "key4": "value4",
#           "key5": "value5"}
#
# keys = list(slovar.keys())
# values = list(slovar.values())
#
# print(keys)
# print(values)
#=============================================================================
# slovar = {"key1": "value1",
#           "key2": "value2",
#           "key3": "value3",
#           "key4": "value4",
#           "key5": "value5"}
# keys = []
# values = []
#
# for i in slovar:
#     keys = i
#     print(keys)
#     values = slovar[i]
#     print(values)
# =======================================================
# x = ["Никита", "Екатерина", "Арсалан", "Наталья", "Григорий", "Евгений", "Анастасия", "Андрей", "Евгения", "Герман", "Тимур", "Ярослава", "Есения", "Даниил", "Данил"]
# zadacha = 0
# a =  input('Введи имя: ').title()
# for i in x:
#     if a == i:
#         zadacha += 1
# print(zadacha)
# ==============================================================================
# x = ["Никита", "Екатерина", "Арсалан", "Наталья", "Григорий", "Евгений", "Анастасия", "Андрей", "Евгения", "Герман", "Тимур", "Ярослава", "Есения", "Даниил", "Данил"]
# a = input('Введи имя: ').title()
# print(x.count(a))

a = int(input('Введи чиселько: '))































